Revit 2027 API
Color.Blue Property
Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public byte Blue { get; set; }
Public Property Blue As Byte
	Get
	Set
public:
property unsigned char Blue {
	unsigned char get ();
	void set (unsigned char value);
}
member Blue : byte with get, set
Property Value
Byte
Exceptions
Exception | Condition
InvalidOperationException | When getting the value: the color is invalid or uninitialized.
See Also
Reference
Color Class
Autodesk.Revit.DB Namespace